РП/src/Catalogs/ШаблоныПроводокДляМеждународногоУчета/ШаблоныПроводокДляМеждународногоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныПроводокДляМеждународногоУчета</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДебетаПоУмолчанию</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКредитаПоУмолчанию</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИсточникаУточненияСчетаДт</name>
    <type>
      <types>EnumRef.ТипыИсточниковУточненияСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИсточникаУточненияСчетаКт</name>
    <type>
      <types>EnumRef.ТипыИсточниковУточненияСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПодразделенияДт</name>
    <type>
      <types>EnumRef.ИсточникиПодразделенийАналитическихРегистров</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПодразделенияКт</name>
    <type>
      <types>EnumRef.ИсточникиПодразделенийАналитическихРегистров</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСуммыВВалютеДт</name>
    <type>
      <types>EnumRef.ПоказателиАналитическихРегистров</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникСуммыВВалютеКт</name>
    <type>
      <types>EnumRef.ПоказателиАналитическихРегистров</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникБалансовойСуммы</name>
    <type>
      <types>EnumRef.ПоказателиАналитическихРегистров</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменятьЗнакОперацииПриОтраженииВУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеУточнениеПроводки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановленДополнительныйОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСовместногоПрименения</name>
    <type>
      <types>EnumRef.ВариантыСовместногоПримененияШаблоновПроводок</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоГруппаШаблонов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

РП/src/Enums/ВариантыСовместногоПримененияШаблоновПроводок/ВариантыСовместногоПримененияШаблоновПроводок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыСовместногоПримененияШаблоновПроводок</name>
  <enumValues>
    <name>Вытеснение</name>
  </enumValues>
  <enumValues>
    <name>Все</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/ШаблоныПроводокДляМеждународногоУчета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует компоновщик настроек компоновки данных,
// по данным источника получения данных хозяйственной операции.
//
// Параметры:
//	Форма - Форма - форма объекта.
//	ХозяйственнаяОперация - СправочникСсылка.НастройкиХозяйственныхОпераций - хозяйственная операция,
//							определяющая источник получения данных.
//
Процедура ИнициализироватьКомпоновщик(Форма, ХозяйственнаяОперация) Экспорт

	Форма.АдресСхемыКомпоновкиДанных = ПолучитьСхемуКомпоновкиДанных(Форма, ХозяйственнаяОперация);
	Если ЗначениеЗаполнено(Форма.АдресСхемыКомпоновкиДанных) Тогда
		Форма.Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Форма.АдресСхемыКомпоновкиДанных));
	КонецЕсли;

КонецПроцедуры

// Загружает настройки в компоновщик настроек.
//
// Параметры:
//	Форма - Форма - форма объекта.
//	Настройки - НастройкиКомпоновкиДанных - загружаемые настройки.
//
Процедура ЗагрузитьНастройки(Форма, Настройки) Экспорт

	Если Настройки <> Неопределено Тогда
		Форма.Компоновщик.ЗагрузитьНастройки(Настройки);
	КонецЕсли;

КонецПроцедуры

// Записывает информацию о дополнительном отборе, установленном в объекте.
// Вызывается в событиях "ПередЗаписьюНаСервере" в формах справочника.
//
// Параметры:
//	Форма - Форма - форма объекта.
//	Объект - СправочникОбъект.ШаблоныПроводокДляМеждународногоУчета - записываемый объект.  
//
Процедура ЗаписатьДополнительныйОтбор(Форма, Объект) Экспорт

	Объект.ДополнительныйОтбор = Новый ХранилищеЗначения(Форма.Компоновщик.ПолучитьНастройки());
	Объект.ПредставлениеОтбора = Строка(Форма.Компоновщик.Настройки.Отбор);

КонецПроцедуры

// Формирует индекс картинки для объекта справочника.
//
// Параметры:
//	ШаблонПроводки - СправочникОбъект.ШаблоныПроводокДляМеждународногоУчета - шаблон проводки.
//
// Возвращаемое значение:
//	Число - индекс картинки.
//
Функция ИндексКартинки(ШаблонПроводки) Экспорт

	Если ШаблонПроводки.ЭтоГруппаШаблонов Тогда
		Если ШаблонПроводки.ВариантСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияШаблоновПроводок.Все Тогда
			Результат = 0;
		Иначе
			Результат = 1;
		КонецЕсли;
	Иначе
		Результат = 2;
	КонецЕсли;
	
	Если ШаблонПроводки.ПометкаУдаления Тогда
		Результат = Результат + 3
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка = Ложь;
		ЭтоГруппаШаблонов = Ложь;
		ШаблонПроводки = Неопределено;
		Если Параметры.Свойство("Ключ", ШаблонПроводки) И ЗначениеЗаполнено(ШаблонПроводки) Тогда
			ЭтоГруппаШаблонов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонПроводки, "ЭтоГруппаШаблонов");
		ИначеЕсли Параметры.Свойство("ДополнительныеПараметры") Тогда
			Если Параметры.ДополнительныеПараметры.Свойство("ЭтоГруппаШаблонов") Тогда
				ЭтоГруппаШаблонов = Параметры.ДополнительныеПараметры.ЭтоГруппаШаблонов;
			КонецЕсли;
		КонецЕсли;
		
		ВыбраннаяФорма = "Справочник.ШаблоныПроводокДляМеждународногоУчета.Форма." + ?(ЭтоГруппаШаблонов, "ФормаГруппы", "ФормаЭлемента");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСхемуКомпоновкиДанных(Форма, ХозяйственнаяОперация)

	АдресСКД = Неопределено;
	СхемаКомпоновкиДанных = Справочники.НастройкиХозяйственныхОпераций.СхемаПолученияДанных(ХозяйственнаяОперация);
	Если СхемаКомпоновкиДанных <> Неопределено Тогда
		АдресСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Форма.УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат АдресСКД;

КонецФункции

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#КонецОбласти

#КонецЕсли
